tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationPlatform.cpp
CommandDecision decideCommand(const CommandView& cmd, void*) {
    IrrigationApp& app = IrrigationApp::instance();
    const char* key = cmd.capability->key;

    if (keyIs(key, kKeyStop)) {
        return {true, nullptr};  // idle stop is idempotent success
    }
    if (keyIs(key, kKeyPlans) || keyIs(key, kKeyAutomatic)) {
        if (!app.businessReady()) return {false, "controller_unavailable"};
        return {true, nullptr};
    }
    if (keyIs(key, kKeyStartManual) || keyIs(key, kKeySingleOutput)) {
        if (!app.businessReady()) return {false, "controller_unavailable"};
        if (app.wateringActive()) return {false, "busy"};
        // Re-validate by actually attempting admission in execute; decide only
        // guards the obvious exclusions so the same business validator runs.
        return {true, nullptr};
    }
    return {false, "unknown_capability"};
}

void executeCommand(CommandHandle handle, const CommandView& cmd, void*);

CommandInbox g_inbox(
    model_irrigation_controller_6_zone::contract, g_session, g_publisher, g_io,
    g_inputDoc, g_compareDoc, g_commandSlots, kCommandSlots, g_commandFrames,
    kCommandFrameBytes, decideCommand, executeCommand, nullptr);

void executeCommand(CommandHandle handle, const CommandView& cmd, void*) {
    IrrigationApp& app = IrrigationApp::instance();
    PendingCommand& pc = g_pending[handle.index];
    pc = {};
    pc.handle = handle;
    std::snprintf(pc.capability, sizeof(pc.capability), "%s",
                  cmd.capability->key);
    std::snprintf(pc.commandId, sizeof(pc.commandId), "%s", cmd.commandId);
    pc.active = true;
    const char* key = cmd.capability->key;

    if (keyIs(key, kKeyPlans)) {
        // Full replacement of visible plans; disabled-zone durations are kept
        // by the config layer and are simply not present in this projection.
        const IrrigationConfig* current = app.configuration();
        if (!current) {
            g_inbox.progress(handle, ProgressStatus::Failed,
                             "persistence_error");
            pc.active = false;
            return;
        }
        IrrigationConfig next = *current;
        const uint32_t expectedRevision =
            cmd.parameters["revision"].as<uint32_t>();
        if (expectedRevision != next.revision) {
            g_inbox.progress(handle, ProgressStatus::Failed,
                             "revision_conflict");
            pc.active = false;
            return;
        }
        // Full replacement of the *visible* plan projection. Plans absent from
        // the command are removed from the visible model, but per the contract
        // disabled-zone durations are preserved internally and never wiped.
        std::array<bool, kWateringPlanCount> supplied{};
        bool bad = false;
        const JsonArrayConst plansIn =
            cmd.parameters["plans"].as<JsonArrayConst>();
        for (JsonVariantConst p : plansIn) {
            const uint8_t id = static_cast<uint8_t>(p["id"].as<int>());
            if (id < 1 || id > kWateringPlanCount) { bad = true; break; }
            supplied[id - 1] = true;
            WateringPlan& plan = next.plans[id - 1];
            plan.configured = true;
            plan.id = id;
            plan.scheduleEnabled = p["automaticEnabled"].as<bool>();
            const char* name = p["name"].as<const char*>();
            std::snprintf(plan.name.data(), plan.name.size(), "%s",
                          name ? name : "");
            plan.startMinutes.fill(kUnusedStartMinute);
            uint8_t m = 0;
            for (JsonVariantConst minute :
                 p["startMinutes"].as<JsonArrayConst>()) {
                if (m >= kPlanStartTimeCount) { bad = true; break; }
                plan.startMinutes[m++] =
                    static_cast<uint16_t>(minute.as<int>());
            }
            // Reset only enabled (visible) zones; disabled zones keep their
            // hidden baseline duration and are absent from the projection.
            for (uint8_t zi = 0;
                 zi < BoardPins::kZoneCount && !bad; ++zi) {
                if (next.zones[zi].enabled)
                    plan.zoneDurationMinutes[zi] = 0;
            }
            for (JsonVariantConst z : p["zones"].as<JsonArrayConst>()) {
                const uint8_t zoneId =
                    static_cast<uint8_t>(z["zoneId"].as<int>());
                if (!BoardPins::isValidZoneId(zoneId) ||
                    !next.zones[BoardPins::zoneIndex(zoneId)].enabled) {
                    // Referencing a disabled/unknown zone is rejected.
                    bad = true;
                    break;
                }
                plan.zoneDurationMinutes[BoardPins::zoneIndex(zoneId)] =
                    static_cast<uint16_t>(z["durationMinutes"].as<int>());
            }
            if (bad) break;
        }
        if (!bad) {
            for (uint8_t pi = 0; pi < kWateringPlanCount; ++pi) {
                if (supplied[pi]) continue;
                WateringPlan& plan = next.plans[pi];
                plan.configured = false;
                plan.scheduleEnabled = false;
                plan.name[0] = '\0';
                plan.startMinutes.fill(kUnusedStartMinute);
                for (uint8_t zi = 0; zi < BoardPins::kZoneCount; ++zi) {
                    if (next.zones[zi].enabled)
                        plan.zoneDurationMinutes[zi] = 0;
                    // disabled-zone hidden durations are retained
                }
            }
        }
        if (bad) {
            g_inbox.progress(handle, ProgressStatus::Failed, "invalid_request");
            pc.active = false;
            return;
        }
        const bool ok = app.saveConfiguration(
            next, expectedRevision,
            IrrigationEvents::ConfigurationChange::PlanUpdated);
        if (!ok) {
            g_inbox.progress(handle, ProgressStatus::Failed,
                             app.configurationError() ? "persistence_error"
                                                      : "invalid_request");
            pc.active = false;
            return;
        }
        g_inbox.progress(handle, ProgressStatus::Succeeded);
        pc.active = false;
        return;
    }

    if (keyIs(key, kKeyAutomatic)) {
        const char* mode = cmd.parameters["mode"].as<const char*>();
        bool ok = false;
        if (mode && std::strcmp(mode, "enabled") == 0) {
            ok = app.resumeAutomaticWatering();
        } else if (mode && std::strcmp(mode, "paused-indefinitely") == 0) {
            ok = app.pauseAutomaticWateringIndefinitely();
        } else if (mode && std::strcmp(mode, "paused-until") == 0) {
            const uint32_t resume =
                cmd.parameters["resumeAtEpoch"].as<uint32_t>();
                ok = app.pauseAutomaticWateringUntil(resume);
        }
        g_inbox.progress(handle, ok ? ProgressStatus::Succeeded
                                    : ProgressStatus::Failed,
                         ok ? nullptr : "persistence_error");
        pc.active = false;
        return;
    }

    if (keyIs(key, kKeyStop)) {
        // Stop is an independent instant command: it succeeds even when idle.
        app.stopWatering();
        g_inbox.progress(handle, ProgressStatus::Succeeded);
        pc.active = false;
        return;
    }

    // start-manual / single-output are process commands.
    const WateringStartResult result = submitWatering(cmd, pc);
    if (result != WateringStartResult::Started) {
        g_inbox.progress(handle, ProgressStatus::Failed,
                         startResultReason(result));
        pc.active = false;
        return;
    }
    // running progress is emitted by progressPoll once the controller is active.
}

void progressPoll() {
    IrrigationApp& app = IrrigationApp::instance();
    for (PendingCommand& pc : g_pending) {
        if (!pc.active) continue;
        const bool isProcess =
            keyIs(pc.capability, kKeyStartManual) ||
            keyIs(pc.capability, kKeySingleOutput);
        if (!isProcess) { pc.active = false; continue; }
        if (!pc.runningSent && app.wateringActive()) {
            if (g_inbox.progress(pc.handle, ProgressStatus::Running))
                pc.runningSent = true;
            continue;
        }
        if (app.wateringActive()) continue;
        // Read the terminal result only once the process has gone idle so the
        // status reflects this command's outcome rather than a stale value.
        const WateringStatus status = app.wateringStatus();
        ProgressStatus terminal = ProgressStatus::Succeeded;
        const char* reason = nullptr;
        if (status.lastResult == WateringResult::Stopped) {
            terminal = ProgressStatus::Canceled;
        } else if (status.lastResult == WateringResult::Failed ||
                   status.lastResult == WateringResult::Incomplete) {
            terminal = ProgressStatus::Failed;
            reason = "watering_failed";
        }
        if (g_inbox.progress(pc.handle, terminal, reason)) pc.active = false;
    }
}

// ---- identity -------------------------------------------------------------

